waveshareteam/Waveshare-ESP32-components/bsp/esp32_p4_wifi6_db/esp32_p4_wifi6_db.c
#include <stdatomic.h>
#include <string.h>
#include "driver/gpio.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_spiffs.h"
#include "esp_vfs_fat.h"
#include "usb/usb_host.h"
#include "esp_video_device.h"
#include "esp_video_init.h"
#include "esp_codec_dev_defaults.h"
#if SOC_SDMMC_IO_POWER_EXTERNAL
#include "sd_pwr_ctrl_by_on_chip_ldo.h"
#endif

#include "bsp/esp32_p4_wifi6_db.h"
#include "bsp_err_check.h"
#include <assert.h>
#include "esp_ldo_regulator.h"
#if CONFIG_BSP_LCD_TYPE_800_1280_10_1_INCH_A || CONFIG_BSP_LCD_TYPE_800_1280_8_INCH_A
#include "esp_lcd_jd9365.h"
#elif CONFIG_BSP_LCD_TYPE_720_1280_7_INCH_A
#include "esp_lcd_ili9881c.h"
#elif CONFIG_BSP_LCD_TYPE_720_1280_5_INCH_A
#include "esp_lcd_hx8394.h"
#endif
#include "esp_lcd_mipi_dsi.h"
#include "esp_lcd_panel_ops.h"
#include "bsp/display.h"
#include "bsp/touch.h"
#include "esp_lcd_touch_gt911.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

static const char *TAG = "ESP32-P4-WIFI6-DB";

static esp_err_t bsp_sdcard_shared_host_init(void)
{
    sdmmc_host_state_t state = {0};
    ESP_RETURN_ON_ERROR(sdmmc_host_get_state(&state), TAG,
                        "Get SDMMC host state failed");
    return state.host_initialized ? ESP_OK : sdmmc_host_init();
}

/**
 * @brief I2C handle for BSP usage
 *
 * In IDF v5.4 you can call i2c_master_get_bus_handle(BSP_I2C_NUM, i2c_master_bus_handle_t *ret_handle)
 * from #include "esp_private/i2c_platform.h" to get this handle
 *
 * For IDF 5.2 and 5.3 you must call bsp_i2c_get_handle()
 */
static i2c_master_bus_handle_t i2c_handle = NULL;
static bool i2c_initialized = false;
static i2c_master_dev_handle_t lcd_backlight_handle = NULL;
static int lcd_brightness_percent = 0;
static sdmmc_card_t *bsp_sdcard = NULL;
#if SOC_SDMMC_IO_POWER_EXTERNAL
static sd_pwr_ctrl_handle_t s_sdcard_pwr_ctrl = NULL;
#endif
static i2s_chan_handle_t i2s_tx_chan = NULL;
static i2s_chan_handle_t i2s_rx_chan = NULL;
static const audio_codec_data_if_t *i2s_data_if = NULL;
static uint16_t i2s_mclk_multiple = 256;
static TaskHandle_t usb_host_task;
static SemaphoreHandle_t usb_host_done_sem;
static atomic_bool usb_host_stop_requested;

static const gpio_num_t header_gpios[] = {
    GPIO_NUM_52,
    GPIO_NUM_51,
    GPIO_NUM_31,
    GPIO_NUM_30,
    GPIO_NUM_29,
    GPIO_NUM_28,
    GPIO_NUM_50,
    GPIO_NUM_49,
    GPIO_NUM_5,
    GPIO_NUM_4,
    GPIO_NUM_3,
    GPIO_NUM_2,
    GPIO_NUM_24,
    GPIO_NUM_25,
    GPIO_NUM_20,
    GPIO_NUM_21,
    GPIO_NUM_22,
    GPIO_NUM_23,
    GPIO_NUM_26,
    GPIO_NUM_27,
    GPIO_NUM_32,
    GPIO_NUM_33,
    GPIO_NUM_46,
    GPIO_NUM_47,
    GPIO_NUM_48,
};

const gpio_num_t *bsp_get_header_gpios(size_t *count)
{
    if (count) {
        *count = sizeof(header_gpios) / sizeof(header_gpios[0]);
    }
    return header_gpios;
}

#define BSP_I2S_GPIO_CFG       \
    {                          \
        .mclk = BSP_I2S_MCLK,  \
        .bclk = BSP_I2S_SCLK,  \
        .ws = BSP_I2S_LRCK,    \
        .dout = BSP_I2S_DOUT,  \
        .din = BSP_I2S_DIN,    \
        .invert_flags = {      \
            .mclk_inv = false, \
            .bclk_inv = false, \
            .ws_inv = false,   \
        },                     \
    }

#define BSP_I2S_DUPLEX_MONO_CFG(_sample_rate)                                                        \
    {                                                                                                \
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(_sample_rate),                                         \
        .slot_cfg = I2S_STD_PHILIP_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO), \
        .gpio_cfg = BSP_I2S_GPIO_CFG,                                                                 \
    }
esp_err_t bsp_i2c_init(void)
{
    /* I2C was initialized before */
    if (i2c_initialized) {
        return ESP_OK;
    }

    const i2c_master_bus_config_t i2c_config = {
        .i2c_port = BSP_I2C_NUM,
        .sda_io_num = BSP_I2C_SDA,
        .scl_io_num = BSP_I2C_SCL,
        .clk_source = I2C_CLK_SRC_DEFAULT,
    };
    BSP_ERROR_CHECK_RETURN_ERR(i2c_new_master_bus(&i2c_config, &i2c_handle));

    i2c_initialized = true;

    return ESP_OK;
}

esp_err_t bsp_i2c_deinit(void)
{
    if (!i2c_initialized) {
        return ESP_OK;
    }
    BSP_ERROR_CHECK_RETURN_ERR(bsp_display_brightness_deinit());
    BSP_ERROR_CHECK_RETURN_ERR(i2c_del_master_bus(i2c_handle));
    i2c_handle = NULL;
    i2c_initialized = false;
    return ESP_OK;
}

i2c_master_bus_handle_t bsp_i2c_get_handle(void)
{
    BSP_ERROR_CHECK_RETURN_NULL(bsp_i2c_init());
    return i2c_handle;
}

esp_err_t bsp_spiffs_mount(void)
{
    esp_vfs_spiffs_conf_t conf = {
        .base_path = CONFIG_BSP_SPIFFS_MOUNT_POINT,
        .partition_label = CONFIG_BSP_SPIFFS_PARTITION_LABEL,
        .max_files = CONFIG_BSP_SPIFFS_MAX_FILES,
#ifdef CONFIG_BSP_SPIFFS_FORMAT_ON_MOUNT_FAIL
        .format_if_mount_failed = true,
#else
        .format_if_mount_failed = false,
#endif
    };

    esp_err_t ret_val = esp_vfs_spiffs_register(&conf);

    BSP_ERROR_CHECK_RETURN_ERR(ret_val);

    size_t total = 0, used = 0;
    ret_val = esp_spiffs_info(conf.partition_label, &total, &used);
    if (ret_val != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret_val));
        esp_err_t unregister_ret = esp_vfs_spiffs_unregister(conf.partition_label);
        if (unregister_ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to roll back SPIFFS mount (%s)", esp_err_to_name(unregister_ret));
        }
    } else {
        ESP_LOGI(TAG, "Partition size: total: %zu, used: %zu", total, used);
    }

    return ret_val;
}

esp_err_t bsp_spiffs_unmount(void)
{
    return esp_vfs_spiffs_unregister(CONFIG_BSP_SPIFFS_PARTITION_LABEL);
}

sdmmc_card_t *bsp_sdcard_get_handle(void)
{
    return bsp_sdcard;
}

void bsp_sdcard_get_sdmmc_host(const int slot, sdmmc_host_t *config)
{
    assert(config);
    sdmmc_host_t host_config = SDMMC_HOST_DEFAULT();
    host_config.slot = slot;
    host_config.max_freq_khz = SDMMC_FREQ_HIGHSPEED;
#if SOC_SDMMC_IO_POWER_EXTERNAL
    host_config.pwr_ctrl_handle = s_sdcard_pwr_ctrl;
#endif
    host_config.init = bsp_sdcard_shared_host_init;
    memcpy(config, &host_config, sizeof(sdmmc_host_t));
}

void bsp_sdcard_sdmmc_get_slot(const int slot, sdmmc_slot_config_t *config)
{
    (void)slot;
    assert(config);
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.clk = BSP_SD_CLK;
    slot_config.cmd = BSP_SD_CMD;
    slot_config.d0 = BSP_SD_D0;
    slot_config.d1 = BSP_SD_D1;
    slot_config.d2 = BSP_SD_D2;
    slot_config.d3 = BSP_SD_D3;
    slot_config.d4 = GPIO_NUM_NC;
    slot_config.d5 = GPIO_NUM_NC;
    slot_config.d6 = GPIO_NUM_NC;
    slot_config.d7 = GPIO_NUM_NC;
    slot_config.cd = SDMMC_SLOT_NO_CD;
    slot_config.wp = SDMMC_SLOT_NO_WP;
    slot_config.width = 4;
    slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;
    memcpy(config, &slot_config, sizeof(sdmmc_slot_config_t));
}

static esp_err_t bsp_sdcard_power_ctrl_init(void)
{
#if SOC_SDMMC_IO_POWER_EXTERNAL
    if (s_sdcard_pwr_ctrl != NULL) {
        return ESP_OK;
    }

