waveshareteam/Waveshare-ESP32-components/bsp/esp32_p4_wifi6_db/esp32_p4_wifi6_db.c
esp_err_t bsp_audio_init(const i2s_std_config_t *i2s_config)
{
    const i2s_std_config_t default_config = BSP_I2S_DUPLEX_MONO_CFG(BSP_I2S_DEFAULT_SAMPLE_RATE_HZ);
    const i2s_std_config_t *config = i2s_config ? i2s_config : &default_config;

    if (i2s_tx_chan && i2s_rx_chan && i2s_data_if) {
        /* Without an explicit configuration keep the running one. With one,
           apply it rather than silently ignoring the caller's request. */
        if (i2s_config == NULL) {
            return ESP_OK;
        }
        ESP_RETURN_ON_ERROR(bsp_audio_reconfig(config), TAG, "Reconfigure I2S failed");
        i2s_mclk_multiple = config->clk_cfg.mclk_multiple ? config->clk_cfg.mclk_multiple : 256;
        return ESP_OK;
    }
    bsp_audio_reset();

    i2s_chan_config_t chan_config = I2S_CHANNEL_DEFAULT_CONFIG(CONFIG_BSP_I2S_NUM, I2S_ROLE_MASTER);
    chan_config.auto_clear = true;
    esp_err_t ret = i2s_new_channel(&chan_config, &i2s_tx_chan, &i2s_rx_chan);
    ESP_GOTO_ON_ERROR(ret, fail, TAG, "Create I2S channels failed");

    i2s_mclk_multiple = config->clk_cfg.mclk_multiple ? config->clk_cfg.mclk_multiple : 256;
    ret = i2s_channel_init_std_mode(i2s_tx_chan, config);
    ESP_GOTO_ON_ERROR(ret, fail, TAG, "Initialize I2S TX failed");
    ret = i2s_channel_init_std_mode(i2s_rx_chan, config);
    ESP_GOTO_ON_ERROR(ret, fail, TAG, "Initialize I2S RX failed");
    ret = i2s_channel_enable(i2s_tx_chan);
    ESP_GOTO_ON_ERROR(ret, fail, TAG, "Enable I2S TX failed");
    ret = i2s_channel_enable(i2s_rx_chan);
    ESP_GOTO_ON_ERROR(ret, fail, TAG, "Enable I2S RX failed");

    audio_codec_i2s_cfg_t i2s_cfg = {
        .port = CONFIG_BSP_I2S_NUM,
        .tx_handle = i2s_tx_chan,
        .rx_handle = i2s_rx_chan,
    };
    i2s_data_if = audio_codec_new_i2s_data(&i2s_cfg);
    if (i2s_data_if == NULL) {
        ret = ESP_ERR_NO_MEM;
        goto fail;
    }
    return ESP_OK;

fail:
    bsp_audio_reset();
    return ret;
}

static esp_codec_dev_handle_t bsp_audio_codec_init(esp_codec_dev_type_t device_type)
{
    if (bsp_i2c_init() != ESP_OK) {
        return NULL;
    }
    if (!i2s_data_if) {
        if (bsp_audio_init(NULL) != ESP_OK) {
            return NULL;
        }
    }

    const audio_codec_gpio_if_t *gpio_if = audio_codec_new_gpio();
    if (gpio_if == NULL) {
        return NULL;
    }
    audio_codec_i2c_cfg_t i2c_cfg = {
        .port = BSP_I2C_NUM,
        .addr = ES8311_CODEC_DEFAULT_ADDR,
        .bus_handle = i2c_handle,
    };
    const audio_codec_ctrl_if_t *ctrl_if = audio_codec_new_i2c_ctrl(&i2c_cfg);
    if (ctrl_if == NULL) {
        audio_codec_delete_gpio_if(gpio_if);
        return NULL;
    }
    const esp_codec_dev_hw_gain_t gain = {
        .pa_voltage = 5.0,
        .codec_dac_voltage = 3.3,
    };
    es8311_codec_cfg_t codec_cfg = {
        .ctrl_if = ctrl_if,
        .gpio_if = gpio_if,
        .codec_mode = ESP_CODEC_DEV_WORK_MODE_BOTH,
        .pa_pin = BSP_POWER_AMP_IO,
        .pa_reverted = false,
        .master_mode = false,
        .use_mclk = true,
        .digital_mic = false,
        .no_dac_ref = true,
        .invert_mclk = false,
        .invert_sclk = false,
        .hw_gain = gain,
        .mclk_div = i2s_mclk_multiple,
    };
    const audio_codec_if_t *codec_if = es8311_codec_new(&codec_cfg);
    if (!codec_if) {
        audio_codec_delete_ctrl_if(ctrl_if);
        audio_codec_delete_gpio_if(gpio_if);
        return NULL;
    }
    esp_codec_dev_cfg_t dev_cfg = {
        .dev_type = device_type,
        .codec_if = codec_if,
        .data_if = i2s_data_if,
    };
    esp_codec_dev_handle_t device = esp_codec_dev_new(&dev_cfg);
    if (device == NULL) {
        audio_codec_delete_codec_if(codec_if);
        audio_codec_delete_ctrl_if(ctrl_if);
        audio_codec_delete_gpio_if(gpio_if);
    }
    return device;
}

esp_codec_dev_handle_t bsp_audio_codec_speaker_init(void)
{
    return bsp_audio_codec_init(ESP_CODEC_DEV_TYPE_OUT);
}

esp_codec_dev_handle_t bsp_audio_codec_microphone_init(void)
{
    return bsp_audio_codec_init(ESP_CODEC_DEV_TYPE_IN);
}

static const char *LCD_TAG = "BSP-DISPLAY";
static esp_ldo_channel_handle_t s_mipi_phy_ldo;
static esp_lcd_dsi_bus_handle_t s_mipi_dsi_bus;
#if (BSP_CONFIG_NO_GRAPHIC_LIB == 0)
static lv_display_t *s_display;
static lv_indev_t *s_touch_indev;
#endif
static esp_lcd_touch_handle_t s_touch;
static esp_lcd_panel_io_handle_t s_touch_io;
static bsp_lcd_handles_t s_display_handles;

esp_err_t bsp_display_brightness_init(void)
{
    if (lcd_backlight_handle != NULL) {
        return ESP_OK;
    }

    ESP_RETURN_ON_ERROR(bsp_i2c_init(), LCD_TAG, "Initialize backlight I2C bus failed");
    const i2c_device_config_t backlight_config = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = BSP_LCD_BACKLIGHT_I2C_ADDRESS,
        .scl_speed_hz = BSP_I2C_CLK_SPEED_HZ,
    };
    ESP_RETURN_ON_ERROR(
        i2c_master_bus_add_device(i2c_handle, &backlight_config, &lcd_backlight_handle),
        LCD_TAG, "Register backlight controller failed"
    );

    const uint8_t data_to_send[2] = {
        BSP_LCD_BACKLIGHT_BRIGHTNESS_REG,
        0,
    };
    esp_err_t ret = i2c_master_transmit(
        lcd_backlight_handle, data_to_send, sizeof(data_to_send), 100
    );
    if (ret != ESP_OK) {
        (void)i2c_master_bus_rm_device(lcd_backlight_handle);
        lcd_backlight_handle = NULL;
        return ret;
    }
    lcd_brightness_percent = 0;
    return ESP_OK;
}

int bsp_display_brightness_get(void)
{
    return lcd_brightness_percent;
}

esp_err_t bsp_display_brightness_set(int brightness_percent)
{
    brightness_percent = brightness_percent < 0 ? 0 : brightness_percent;
    brightness_percent = brightness_percent > 100 ? 100 : brightness_percent;

    ESP_RETURN_ON_ERROR(bsp_display_brightness_init(), LCD_TAG, "Initialize backlight controller failed");
    const uint8_t data = (uint8_t)(255U * (uint32_t)brightness_percent / 100U);
    const uint8_t data_to_send[2] = {
        BSP_LCD_BACKLIGHT_BRIGHTNESS_REG,
        data,
    };
    ESP_RETURN_ON_ERROR(
        i2c_master_transmit(lcd_backlight_handle, data_to_send, sizeof(data_to_send), 100),
        LCD_TAG, "Set backlight brightness failed"
    );
    lcd_brightness_percent = brightness_percent;
    return ESP_OK;
}

