waveshareteam/Waveshare-ESP32-components/bsp/esp32_p4_wifi6_db/esp32_p4_wifi6_db.c
esp_err_t bsp_display_backlight_off(void)
{
    return bsp_display_brightness_set(0);
}

esp_err_t bsp_display_backlight_on(void)
{
    return bsp_display_brightness_set(100);
}

esp_err_t bsp_display_brightness_deinit(void)
{
    if (lcd_backlight_handle == NULL) {
        lcd_brightness_percent = 0;
        return ESP_OK;
    }

    const uint8_t data_to_send[2] = {
        BSP_LCD_BACKLIGHT_BRIGHTNESS_REG,
        0,
    };
    esp_err_t transmit_ret = i2c_master_transmit(
        lcd_backlight_handle, data_to_send, sizeof(data_to_send), 100
    );
    esp_err_t remove_ret = i2c_master_bus_rm_device(lcd_backlight_handle);
    lcd_backlight_handle = NULL;
    lcd_brightness_percent = 0;
    return transmit_ret != ESP_OK ? transmit_ret : remove_ret;
}

static esp_err_t bsp_enable_dsi_phy_power(void)
{
    if (s_mipi_phy_ldo != NULL) {
        return ESP_OK;
    }

    const esp_ldo_channel_config_t ldo_config = {
        .chan_id = BSP_MIPI_DSI_PHY_PWR_LDO_CHAN,
        .voltage_mv = BSP_MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV,
    };
    ESP_RETURN_ON_ERROR(esp_ldo_acquire_channel(&ldo_config, &s_mipi_phy_ldo), LCD_TAG,
                        "Acquire MIPI DSI PHY LDO failed");
    ESP_LOGI(LCD_TAG, "MIPI DSI PHY powered by LDO%d at %dmV",
             BSP_MIPI_DSI_PHY_PWR_LDO_CHAN, BSP_MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV);
    return ESP_OK;
}

esp_err_t bsp_display_new(const bsp_display_config_t *config, esp_lcd_panel_handle_t *ret_panel,
                          esp_lcd_panel_io_handle_t *ret_io)
{
    ESP_RETURN_ON_FALSE(ret_panel && ret_io, ESP_ERR_INVALID_ARG, LCD_TAG,
                        "Invalid display output handle");
    bsp_lcd_handles_t handles = {0};
    ESP_RETURN_ON_ERROR(bsp_display_new_with_handles(config, &handles),
                        LCD_TAG, "Create display failed");
    *ret_panel = handles.panel;
    *ret_io = handles.io;
    return ESP_OK;
}

__attribute__((weak)) esp_err_t bsp_display_new_with_handles(const bsp_display_config_t *config,
                                       bsp_lcd_handles_t *ret_handles)
{
    esp_err_t ret = ESP_OK;
    esp_lcd_panel_io_handle_t io = NULL;
    esp_lcd_panel_handle_t panel = NULL;
    ESP_RETURN_ON_FALSE(ret_handles != NULL,
                        ESP_ERR_INVALID_ARG, LCD_TAG, "Invalid display argument");
    memset(ret_handles, 0, sizeof(*ret_handles));

    ret = bsp_display_brightness_init();
    ESP_GOTO_ON_ERROR(ret, err, LCD_TAG, "Backlight init failed");
    ret = bsp_enable_dsi_phy_power();
    ESP_GOTO_ON_ERROR(ret, err, LCD_TAG, "DSI PHY power failed");

    const esp_lcd_dsi_bus_config_t bus_config = {
        .bus_id = 0,
        .num_data_lanes = BSP_LCD_MIPI_DSI_LANE_NUM,
        .phy_clk_src = config ? config->dsi_bus.phy_clk_src : 0,
        .lane_bit_rate_mbps =
            (config != NULL && config->dsi_bus.lane_bit_rate_mbps != 0) ?
            config->dsi_bus.lane_bit_rate_mbps : BSP_LCD_MIPI_DSI_LANE_BITRATE_MBPS,
    };
    ret = esp_lcd_new_dsi_bus(&bus_config, &s_mipi_dsi_bus);
    ESP_GOTO_ON_ERROR(ret, err, LCD_TAG, "Create MIPI DSI bus failed");

    const esp_lcd_dbi_io_config_t dbi_config = {
        .virtual_channel = 0,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
    };
    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_io_dbi(s_mipi_dsi_bus, &dbi_config, &io),
                      err, LCD_TAG, "Create MIPI DBI IO failed");

#if CONFIG_BSP_LCD_TYPE_800_1280_10_1_INCH_A || CONFIG_BSP_LCD_TYPE_800_1280_8_INCH_A
#if CONFIG_BSP_LCD_TYPE_800_1280_10_1_INCH_A
    ESP_LOGI(LCD_TAG, "Install Waveshare 10.1-DSI-TOUCH-A JD9365 panel");
#else
    ESP_LOGI(LCD_TAG, "Install Waveshare 8-DSI-TOUCH-A JD9365 panel");
#endif
#if CONFIG_BSP_LCD_COLOR_FORMAT_RGB888
    esp_lcd_dpi_panel_config_t dpi_config =
        JD9365_800_1280_PANEL_60HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB888);
#else
    esp_lcd_dpi_panel_config_t dpi_config =
        JD9365_800_1280_PANEL_60HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB565);
#endif
    dpi_config.num_fbs = (config != NULL && config->num_fbs != 0) ?
                         config->num_fbs : CONFIG_BSP_LCD_DPI_BUFFER_NUMS;

    jd9365_vendor_config_t vendor_config = {
        .mipi_config = {
            .lane_num = BSP_LCD_MIPI_DSI_LANE_NUM,
            .dsi_bus = s_mipi_dsi_bus,
            .dpi_config = &dpi_config,
        },
    };
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = BSP_LCD_RST,
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .vendor_config = &vendor_config,
    };

    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_jd9365(io, &panel_config, &panel),
                      err, LCD_TAG, "Create JD9365 panel failed");
#elif CONFIG_BSP_LCD_TYPE_720_1280_7_INCH_A
    ESP_LOGI(LCD_TAG, "Install Waveshare 7-DSI-TOUCH-A ILI9881C panel");
#if CONFIG_BSP_LCD_COLOR_FORMAT_RGB888
    esp_lcd_dpi_panel_config_t dpi_config =
        ILI9881C_720_1280_PANEL_60HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB888);
#else
    esp_lcd_dpi_panel_config_t dpi_config =
        ILI9881C_720_1280_PANEL_60HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB565);
#endif
    dpi_config.num_fbs = (config != NULL && config->num_fbs != 0) ?
                         config->num_fbs : CONFIG_BSP_LCD_DPI_BUFFER_NUMS;

    ili9881c_vendor_config_t vendor_config = {
        .mipi_config = {
            .lane_num = BSP_LCD_MIPI_DSI_LANE_NUM,
            .dsi_bus = s_mipi_dsi_bus,
            .dpi_config = &dpi_config,
        },
    };
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = BSP_LCD_RST,
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .vendor_config = &vendor_config,
    };

    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_ili9881c(io, &panel_config, &panel),
                      err, LCD_TAG, "Create ILI9881C panel failed");
#elif CONFIG_BSP_LCD_TYPE_720_1280_5_INCH_A
    ESP_LOGI(LCD_TAG, "Install Waveshare 5-DSI-TOUCH-A HX8394 panel");
#if CONFIG_BSP_LCD_COLOR_FORMAT_RGB888
    esp_lcd_dpi_panel_config_t dpi_config =
        HX8394_720_1280_PANEL_30HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB888);
#else
    esp_lcd_dpi_panel_config_t dpi_config =
        HX8394_720_1280_PANEL_30HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB565);
#endif
    dpi_config.num_fbs = (config != NULL && config->num_fbs != 0) ?
                         config->num_fbs : CONFIG_BSP_LCD_DPI_BUFFER_NUMS;

    hx8394_vendor_config_t vendor_config = {
        .mipi_config = {
            .lane_num = BSP_LCD_MIPI_DSI_LANE_NUM,
            .dsi_bus = s_mipi_dsi_bus,
            .dpi_config = &dpi_config,
        },
    };
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = BSP_LCD_RST,
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .vendor_config = &vendor_config,
    };

    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_hx8394(io, &panel_config, &panel),
                      err, LCD_TAG, "Create HX8394 panel failed");
#else
#error "Unsupported LCD type"
#endif

