waveshareteam/Waveshare-ESP32-components/bsp/esp32_p4_wifi6_db/esp32_p4_wifi6_db.c
    ESP_GOTO_ON_ERROR(esp_lcd_panel_reset(panel), err, LCD_TAG, "Reset LCD panel failed");
    ESP_GOTO_ON_ERROR(esp_lcd_panel_init(panel), err, LCD_TAG, "Initialize LCD panel failed");
    ESP_GOTO_ON_ERROR(esp_lcd_panel_disp_on_off(panel, true), err, LCD_TAG, "Turn on LCD panel failed");
    ret_handles->mipi_dsi_bus = s_mipi_dsi_bus;
    ret_handles->io = io;
    ret_handles->panel = panel;
    ret_handles->control = NULL;
    s_display_handles = *ret_handles;
    ESP_LOGI(LCD_TAG, "MIPI-DSI display initialized: %dx%d",
             BSP_LCD_H_RES, BSP_LCD_V_RES);
    return ESP_OK;

err:
    if (panel != NULL) {
        esp_lcd_panel_del(panel);
    }
    if (io != NULL) {
        esp_lcd_panel_io_del(io);
    }
    if (s_mipi_dsi_bus != NULL) {
        esp_lcd_del_dsi_bus(s_mipi_dsi_bus);
        s_mipi_dsi_bus = NULL;
    }
    if (s_mipi_phy_ldo != NULL) {
        esp_err_t cleanup_ret = esp_ldo_release_channel(s_mipi_phy_ldo);
        if (cleanup_ret != ESP_OK) {
            ESP_LOGE(LCD_TAG, "Release MIPI DSI PHY LDO failed: %s",
                     esp_err_to_name(cleanup_ret));
        }
        s_mipi_phy_ldo = NULL;
    }
    esp_err_t cleanup_ret = bsp_display_brightness_deinit();
    if (cleanup_ret != ESP_OK) {
        ESP_LOGE(LCD_TAG, "Deinitialize backlight after display failure failed: %s",
                 esp_err_to_name(cleanup_ret));
    }
    return ret;
}

esp_lcd_panel_handle_t bsp_display_get_panel_handle(void)
{
    return s_display_handles.panel;
}

void bsp_display_delete(void)
{
    if (s_display_handles.panel) {
        esp_err_t ret = esp_lcd_panel_del(s_display_handles.panel);
        if (ret != ESP_OK) {
            ESP_LOGE(LCD_TAG, "Delete LCD panel failed: %s", esp_err_to_name(ret));
        }
        s_display_handles.panel = NULL;
    }
    if (s_display_handles.io) {
        esp_err_t ret = esp_lcd_panel_io_del(s_display_handles.io);
        if (ret != ESP_OK) {
            ESP_LOGE(LCD_TAG, "Delete LCD panel IO failed: %s", esp_err_to_name(ret));
        }
        s_display_handles.io = NULL;
    }
    if (s_mipi_dsi_bus) {
        esp_err_t ret = esp_lcd_del_dsi_bus(s_mipi_dsi_bus);
        if (ret != ESP_OK) {
            ESP_LOGE(LCD_TAG, "Delete MIPI DSI bus failed: %s", esp_err_to_name(ret));
        }
        s_mipi_dsi_bus = NULL;
        s_display_handles.mipi_dsi_bus = NULL;
    }
    if (s_mipi_phy_ldo) {
        esp_err_t ret = esp_ldo_release_channel(s_mipi_phy_ldo);
        if (ret != ESP_OK) {
            ESP_LOGE(LCD_TAG, "Release MIPI DSI PHY LDO failed: %s", esp_err_to_name(ret));
        }
        s_mipi_phy_ldo = NULL;
    }
    esp_err_t ret = bsp_display_brightness_deinit();
    if (ret != ESP_OK) {
        ESP_LOGE(LCD_TAG, "Deinitialize backlight failed: %s", esp_err_to_name(ret));
    }
}

esp_err_t bsp_touch_new(const bsp_touch_config_t *config, esp_lcd_touch_handle_t *ret_touch)
{
    ESP_RETURN_ON_FALSE(ret_touch != NULL, ESP_ERR_INVALID_ARG, LCD_TAG, "Invalid touch handle");
    ESP_RETURN_ON_ERROR(bsp_i2c_init(), LCD_TAG, "Initialize touch I2C bus failed");

    static const uint8_t gt911_addresses[] = {
        ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS,
        ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS_BACKUP,
    };

    *ret_touch = NULL;
    esp_err_t ret = ESP_FAIL;
    for (size_t i = 0; i < sizeof(gt911_addresses) / sizeof(gt911_addresses[0]); i++) {
        esp_lcd_panel_io_i2c_config_t io_config = ESP_LCD_TOUCH_IO_I2C_GT911_CONFIG();
        io_config.dev_addr = gt911_addresses[i];

        esp_lcd_panel_io_handle_t io_handle = NULL;
        ret = esp_lcd_new_panel_io_i2c(bsp_i2c_get_handle(), &io_config, &io_handle);
        if (ret != ESP_OK) {
            ESP_LOGW(LCD_TAG, "Create GT911 I2C IO at 0x%02X failed: %s",
                     io_config.dev_addr, esp_err_to_name(ret));
            continue;
        }

        esp_lcd_touch_io_gt911_config_t gt911_config = {
            .dev_addr = io_config.dev_addr,
        };
        const esp_lcd_touch_config_t touch_config = {
            .x_max = BSP_LCD_H_RES,
            .y_max = BSP_LCD_V_RES,
            .rst_gpio_num = BSP_LCD_TOUCH_RST,
            .int_gpio_num = BSP_LCD_TOUCH_INT,
            .levels = {
                .reset = 0,
                .interrupt = 0,
            },
            .flags = {
                .swap_xy = config ? config->flags.swap_xy : 0,
                .mirror_x = config ? config->flags.mirror_x : 0,
                .mirror_y = config ? config->flags.mirror_y : 0,
            },
            .driver_data = &gt911_config,
        };

        ret = esp_lcd_touch_new_i2c_gt911(io_handle, &touch_config, ret_touch);
        if (ret == ESP_OK) {
            ESP_LOGI(LCD_TAG, "GT911 detected at I2C address 0x%02X", io_config.dev_addr);
            s_touch = *ret_touch;
            s_touch_io = io_handle;
            return ESP_OK;
        }

        ESP_LOGW(LCD_TAG, "GT911 not found at I2C address 0x%02X: %s",
                 io_config.dev_addr, esp_err_to_name(ret));
        esp_lcd_panel_io_del(io_handle);
    }
    return ret;
}

void bsp_touch_delete(void)
{
    if (s_touch != NULL) {
        (void)esp_lcd_touch_del(s_touch);
        s_touch = NULL;
    }
    if (s_touch_io != NULL) {
        (void)esp_lcd_panel_io_del(s_touch_io);
        s_touch_io = NULL;
    }
}

#if (BSP_CONFIG_NO_GRAPHIC_LIB == 0)
static lv_display_t *bsp_display_lcd_init(const bsp_display_cfg_t *config)
{
    const bsp_display_config_t hw_config = {
        .dsi_bus = {
            .phy_clk_src = 0,
            .lane_bit_rate_mbps = BSP_LCD_MIPI_DSI_LANE_BITRATE_MBPS,
        },
        .num_fbs = esp_lv_adapter_get_required_frame_buffer_count(config->tear_avoid_mode,
                                                                  config->rotation),
    };
    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_new_with_handles(&hw_config, &s_display_handles));

    esp_lv_adapter_display_config_t display_config =
        ESP_LV_ADAPTER_DISPLAY_MIPI_DEFAULT_CONFIG(s_display_handles.panel,
                                                   s_display_handles.io,
                                                   BSP_LCD_H_RES,
                                                   BSP_LCD_V_RES,
                                                   config->rotation);
    display_config.tear_avoid_mode = config->tear_avoid_mode;
    return esp_lv_adapter_register_display(&display_config);
}

