waveshareteam/Waveshare-ESP32-components/bsp/esp32_p4_wifi6_db/esp32_p4_wifi6_db.c
static lv_indev_t *bsp_display_touch_init(lv_display_t *display,
                                          const bsp_display_cfg_t *config)
{
    const bsp_touch_config_t touch_config = {
        .flags = {
            .swap_xy = config->touch_flags.swap_xy,
            .mirror_x = config->touch_flags.mirror_x,
            .mirror_y = config->touch_flags.mirror_y,
        },
    };
    if (bsp_touch_new(&touch_config, &s_touch) != ESP_OK) {
        return NULL;
    }

    const esp_lv_adapter_touch_config_t adapter_touch_config =
        ESP_LV_ADAPTER_TOUCH_DEFAULT_CONFIG(display, s_touch);
    return esp_lv_adapter_register_touch(&adapter_touch_config);
}

lv_display_t *bsp_display_start(void)
{
    bsp_display_cfg_t config = {
        .lv_adapter_cfg = ESP_LV_ADAPTER_DEFAULT_CONFIG(),
        .rotation = ESP_LV_ADAPTER_ROTATE_0,
        .tear_avoid_mode = ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_PARTIAL,
        .touch_flags = {
            .swap_xy = 0,
            .mirror_x = 0,
            .mirror_y = 0,
        },
    };
    return bsp_display_start_with_config(&config);
}

lv_display_t *bsp_display_start_with_config(const bsp_display_cfg_t *config)
{
    if (config == NULL) {
        ESP_LOGE(LCD_TAG, "Display configuration is NULL");
        return NULL;
    }

    esp_err_t ret = esp_lv_adapter_init(&config->lv_adapter_cfg);
    if (ret != ESP_OK) {
        ESP_LOGE(LCD_TAG, "Initialize LVGL adapter failed: %s", esp_err_to_name(ret));
        return NULL;
    }

    s_display = bsp_display_lcd_init(config);
    if (s_display == NULL) {
        ESP_LOGE(LCD_TAG, "Register display with LVGL adapter failed");
        goto err;
    }

    s_touch_indev = bsp_display_touch_init(s_display, config);
    if (s_touch_indev == NULL) {
        ESP_LOGW(LCD_TAG, "Touch unavailable; continuing without LVGL input device");
        bsp_touch_delete();
    }

    ret = esp_lv_adapter_start();
    if (ret != ESP_OK) {
        ESP_LOGE(LCD_TAG, "Start LVGL adapter failed: %s", esp_err_to_name(ret));
        goto err;
    }
    return s_display;

err:
    if (s_touch_indev != NULL) {
        esp_lv_adapter_unregister_touch(s_touch_indev);
        s_touch_indev = NULL;
    }
    bsp_touch_delete();
    if (s_display != NULL) {
        esp_lv_adapter_unregister_display(s_display);
        s_display = NULL;
    }
    bsp_display_delete();
    esp_lv_adapter_deinit();
    return NULL;
}

void bsp_display_stop(lv_display_t *display)
{
    if (s_touch_indev != NULL) {
        esp_lv_adapter_unregister_touch(s_touch_indev);
        s_touch_indev = NULL;
    }
    lv_display_t *display_to_remove = display ? display : s_display;
    if (display_to_remove) {
        esp_lv_adapter_unregister_display(display_to_remove);
    }
    esp_lv_adapter_deinit();
    bsp_touch_delete();
    bsp_display_delete();
    s_display = NULL;
}

lv_indev_t *bsp_display_get_input_dev(void)
{
    return s_touch_indev;
}

void bsp_display_rotate(lv_display_t *display, lv_disp_rotation_t rotation)
{
    lv_disp_set_rotation(display, rotation);
}

bool bsp_display_lock(uint32_t timeout_ms)
{
    return esp_lv_adapter_lock(timeout_ms) == ESP_OK;
}

void bsp_display_unlock(void)
{
    esp_lv_adapter_unlock();
}

esp_err_t bsp_display_set_dummy_draw(bool enable)
{
    if (s_display == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    return esp_lv_adapter_set_dummy_draw(s_display, enable);
}

void *bsp_display_get_free_frame_buffer(void)
{
    if (s_display == NULL) {
        return NULL;
    }
    return esp_lv_adapter_dummy_draw_get_free_buf(s_display);
}

esp_err_t bsp_display_flush_frame_buffer(void *frame_buffer)
{
    if (s_display == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    if (frame_buffer == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    return esp_lv_adapter_dummy_draw_flush_buf(s_display, frame_buffer);
}
#endif

static void usb_lib_task(void *arg)
{
    (void)arg;
    while (!atomic_load(&usb_host_stop_requested)) {
        uint32_t event_flags = 0;
        esp_err_t ret = usb_host_lib_handle_events(pdMS_TO_TICKS(100), &event_flags);
        if (ret == ESP_ERR_TIMEOUT) {
            continue;
        }
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "USB Host event handling failed: %s", esp_err_to_name(ret));
            break;
        }
        if (event_flags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS) {
            ret = usb_host_device_free_all();
            if (ret != ESP_OK) {
                ESP_LOGE(TAG, "USB Host device cleanup failed: %s", esp_err_to_name(ret));
            }
        }
        if (event_flags & USB_HOST_LIB_EVENT_FLAGS_ALL_FREE) {
            ESP_LOGI(TAG, "USB: All devices freed");
        }
    }
    usb_host_task = NULL;
    if (usb_host_done_sem != NULL) {
        xSemaphoreGive(usb_host_done_sem);
    }
    vTaskDelete(NULL);
}

esp_err_t bsp_usb_host_start(bsp_usb_host_power_mode_t mode, bool limit_500mA)
{
    (void)mode;
    (void)limit_500mA;
    ESP_RETURN_ON_FALSE(usb_host_task == NULL, ESP_ERR_INVALID_STATE, TAG,
                        "USB Host is already running");
    if (usb_host_done_sem == NULL) {
        usb_host_done_sem = xSemaphoreCreateBinary();
        ESP_RETURN_ON_FALSE(usb_host_done_sem != NULL, ESP_ERR_NO_MEM, TAG,
                            "Create USB Host completion semaphore failed");
    }
    while (xSemaphoreTake(usb_host_done_sem, 0) == pdTRUE) {
    }
    atomic_store(&usb_host_stop_requested, false);
    const usb_host_config_t host_config = {
        .skip_phy_setup = false,
        .intr_flags = ESP_INTR_FLAG_LEVEL1,
    };
    esp_err_t ret = usb_host_install(&host_config);
    if (ret != ESP_OK) {
        vSemaphoreDelete(usb_host_done_sem);
        usb_host_done_sem = NULL;
        return ret;
    }
    if (xTaskCreate(usb_lib_task, "usb_lib", 4096, NULL, 10, &usb_host_task) != pdTRUE) {
        (void)usb_host_uninstall();
        vSemaphoreDelete(usb_host_done_sem);
        usb_host_done_sem = NULL;
        return ESP_ERR_NO_MEM;
    }
    return ESP_OK;
}

esp_err_t bsp_usb_host_stop(void)
{
    if (usb_host_task != NULL) {
        atomic_store(&usb_host_stop_requested, true);
        ESP_RETURN_ON_FALSE(
            usb_host_done_sem != NULL &&
            xSemaphoreTake(usb_host_done_sem, pdMS_TO_TICKS(1000)) == pdTRUE,
            ESP_ERR_TIMEOUT, TAG, "Timed out waiting for USB Host task to stop"
        );
    }

    esp_err_t ret = usb_host_uninstall();
    if (ret != ESP_OK) {
        atomic_store(&usb_host_stop_requested, false);
        if (usb_host_done_sem != NULL &&
            xTaskCreate(usb_lib_task, "usb_lib", 4096, NULL, 10, &usb_host_task) != pdTRUE) {
            ESP_LOGE(TAG, "Restart USB Host task after uninstall failure failed");
        }
        return ret;
    }
    if (usb_host_done_sem != NULL) {
        vSemaphoreDelete(usb_host_done_sem);
        usb_host_done_sem = NULL;
    }
    return ESP_OK;
}

esp_err_t bsp_camera_start(const bsp_camera_cfg_t *cfg)
{
    (void)cfg;
    BSP_ERROR_CHECK_RETURN_ERR(bsp_i2c_init());
    const esp_video_init_csi_config_t csi_config = {
        .sccb_config = {
            .init_sccb = false,
            .i2c_handle = i2c_handle,
            .freq = 400000,
        },
        .reset_pin = BSP_CAMERA_RST,
        .pwdn_pin = GPIO_NUM_NC,
    };
    const esp_video_init_config_t camera_config = {
        .csi = &csi_config,
    };
    return esp_video_init(&camera_config);
}
